[
  {
    "image": "https://cdn.pixabay.com/photo/2016/10/22/00/15/spotify-1759471_1280.jpg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "shortDescription": "Stream millions of songs and podcasts.",
    "fullDescription": "Spotify lets you listen to millions of songs and podcasts from artists all over the world. Discover new music, create playlists, and enjoy personalized recommendations based on your taste. Premium users can listen offline and ad-free with superior sound quality. Available on all major platforms.",
    "size": 85,
    "reviews": 3500000,
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://discover.daraz.com/images/Group_1083-1644460875.svg",
    "title": "Daraz",
    "companyName": "Daraz Group",
    "id": 2,
    "shortDescription": "Online shopping for everything you need.",
    "fullDescription": "Daraz is South Asia’s leading online shopping platform offering millions of products including electronics, fashion, groceries, and more.",
    "size": 60,
    "reviews": 1800000,
    "ratingAvg": 4.3,
    "downloads": "100M+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 780000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/017/395/384/non_2x/youtube-music-icon-free-png.png",
    "title": "YouTube Music",
    "companyName": "Google LLC",
    "id": 3,
    "shortDescription": "Listen to music and watch music videos.",
    "fullDescription": "YouTube Music gives you access to millions of songs, albums, and live performances. Discover new artists, explore trending playlists, and stream ad-free with Premium.",
    "size": 75,
    "reviews": 2000000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 160000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 840000 }
    ]
  },
  {
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple115/v4/c5/48/d3/c548d3a4-6290-52a1-e55a-daa4915153c2/AppIcon-0-0-1x_U007emarketing-0-0-0-7-0-0-sRGB-0-0-0-GLES2_U002c0-512MB-85-220-0-0.png/1200x630wa.png",
    "title": "PLAYit",
    "companyName": "Yuvadvance Internet Pvt. Ltd.",
    "id": 5,
    "shortDescription": "HD video player supporting all formats.",
    "fullDescription": "PLAYit supports all video formats including MP4, MKV, AVI, and more. Stream online videos and use floating play features seamlessly.",
    "size": 45,
    "reviews": 1200000,
    "ratingAvg": 4.6,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 630000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEOF5xMQwmt8ccJV582J1_bnybnDz4B1HD_Q&s",
    "title": "PUBG Mobile",
    "companyName": "Tencent Games",
    "id": 5,
    "shortDescription": "Battle Royale gaming at its finest.",
    "fullDescription": "PUBG Mobile delivers console-quality battle royale gaming with stunning graphics and exciting multiplayer modes.",
    "size": 1800,
    "reviews": 7000000,
    "ratingAvg": 4.3,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 1900000 },
      { "name": "5 star", "count": 2800000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/736x/48/21/c2/4821c2f23537fcdd1a358766e1cacf9b.jpg",
    "title": "Photo Editor",
    "companyName": "EditPro",
    "id": 6,
    "shortDescription": "Edit photos with advanced tools.",
    "fullDescription": "Photo Editor is your go-to app for creating stunning visuals with professional-grade tools. Enhance photos with filters, adjust brightness, contrast, and colors, or add text and stickers for a personal touch. Perfect for social media, personal projects, or professional portfolios, it supports high-resolution editing and batch processing for efficiency. Crop, rotate, or retouch images with precision, and experiment with creative effects like double exposure or blur. The app’s intuitive interface makes editing accessible for beginners and powerful for experts. Save and share your creations directly to social platforms or cloud storage. With regular updates, Photo Editor introduces new filters, templates, and tools to keep your creativity flowing. Collaborate with friends on group projects or explore community galleries for inspiration. Whether you're enhancing everyday snaps or crafting professional designs, Photo Editor delivers endless possibilities. Download now and transform your photos into works of art with ease and style.",
    "size": 50,
    "reviews": 2000,
    "ratingAvg": 4.3,
    "downloads": "800K",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 240 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 980 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/18/05/a3/1805a3366e8062d6fd77806201a8ded7.jpg",
    "title": "Music Player",
    "companyName": "TuneIn",
    "id": 7,
    "shortDescription": "Stream your favorite music tracks.",
    "fullDescription": "Music Player is your ultimate music companion, offering high-quality streaming and offline playback. Create personalized playlists, explore curated genres, and discover new artists with AI-driven recommendations. Adjust audio with a powerful equalizer, supporting bass boost and surround sound. The app’s sleek interface ensures easy navigation, with features like lyrics display, sleep timers, and crossfade for a seamless listening experience. Sync your music library across devices and access cloud-stored tracks effortlessly. Share playlists with friends or join music communities to exchange favorites. With support for multiple audio formats and gapless playback, Music Player caters to audiophiles and casual listeners alike. Enjoy ad-free listening with premium options and regular updates with new features. Whether you're commuting, working out, or relaxing, Music Player delivers crystal-clear sound and endless entertainment. Download now to immerse yourself in music, tailored to your mood and style, anytime, anywhere.",
    "size": 40,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": "600K",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 75 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 440 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1611605698323-b1e99cfd37ea?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8dGlrdG9rJTIwbG9nb3xlbnwwfHwwfHx8MA%3D%3D&fm=jpg&q=60&w=3000",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 3,
    "shortDescription": "Create and share short entertaining videos.",
    "fullDescription": "TikTok is a global platform for short-form videos. Discover viral trends, use filters, and share your creativity with millions.",
    "size": 95,
    "reviews": 8000000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 3400000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Visual_Studio_Code_1.35_icon.svg",
    "title": "Visual Studio Code",
    "companyName": "Microsoft Corporation",
    "id": 6,
    "shortDescription": "Code editing redefined — lightweight and fast.",
    "fullDescription": "VS Code is a powerful source-code editor with built-in debugging, Git control, and extensions for almost any programming language.",
    "size": 150,
    "reviews": 950000,
    "ratingAvg": 4.8,
    "downloads": "100M+",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 725000 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2017/08/Chrome-Logo.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 7,
    "shortDescription": "Fast, secure, and smart web browser.",
    "fullDescription": "Google Chrome is known for speed, simplicity, and security. Sync your bookmarks and browse across devices effortlessly.",
    "size": 120,
    "reviews": 9000000,
    "ratingAvg": 4.6,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4800000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcREj1z2X_dnVNL8zWmZz1dyVER92lqd4fkD0g&s",
    "title": "Microsoft Office",
    "companyName": "Microsoft Corporation",
    "id": 8,
    "shortDescription": "Word, Excel, PowerPoint and more — all in one app.",
    "fullDescription": "Microsoft Office brings Word, Excel, PowerPoint and PDF tools in one place. Work, share and collaborate across devices.",
    "size": 200,
    "reviews": 4000000,
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1100000 },
      { "name": "5 star", "count": 2250000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/09/8a/9a/098a9a920abd405c7c1ad37ad1919540.jpg",
    "title": "Video Editor",
    "companyName": "ClipMaster",
    "id": 12,
    "shortDescription": "Edit videos with professional tools.",
    "fullDescription": "Video Editor empowers creators with professional tools to craft stunning videos for social media, projects, or personal use. Trim, cut, and merge clips with precision, add transitions, filters, and music to elevate your content. Customize videos with text, stickers, and special effects like slow motion or time-lapse. The app supports high-resolution exports and multiple aspect ratios for platforms like YouTube or Instagram. Its intuitive interface makes editing accessible for beginners, while advanced features like keyframe animations cater to pros. Preview edits in real-time, collaborate on projects, and share directly to social platforms. With cloud storage integration and offline editing, your work is always accessible. Video Editor’s regular updates bring new templates and effects to keep your content fresh. Whether you're creating vlogs, tutorials, or memories, this app delivers unmatched creativity. Download Video Editor now to unleash your storytelling potential with professional-grade video editing tools.",
    "size": 55,
    "reviews": 1300,
    "ratingAvg": 4.3,
    "downloads": "450K",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 570 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/40/9a/f4/409af49f7300f5bf8e5a24676a3f5f27.jpg",
    "title": "Meditation Guide",
    "companyName": "ZenMind",
    "id": 13,
    "shortDescription": "Guided meditations for relaxation.",
    "fullDescription": "Meditation Guide is your sanctuary for mindfulness and relaxation, offering guided sessions for all experience levels. Choose from meditations for stress relief, sleep, or focus, with soothing audio and customizable durations. Track your progress with daily streaks and gain insights into your wellness journey. The app features calming music, nature sounds, and breathing exercises to enhance your practice. Create personalized meditation plans, set reminders, and explore mindfulness techniques like body scans or gratitude exercises. With offline access and a minimalist interface, Meditation Guide ensures a distraction-free experience. Join a global community to share tips and participate in group sessions. Whether you're reducing anxiety or seeking inner peace, this app supports your mental well-being. Regular updates add new meditations and features to keep your practice fresh. Download Meditation Guide now to cultivate mindfulness, reduce stress, and find balance in your daily life with ease.",
    "size": 27,
    "reviews": 750,
    "ratingAvg": 4.7,
    "downloads": "280K",
    "ratings": [
      { "name": "1 star", "count": 15 },
      { "name": "2 star", "count": 30 },
      { "name": "3 star", "count": 60 },
      { "name": "4 star", "count": 200 },
      { "name": "5 star", "count": 445 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/6f/48/c4/6f48c461187dba824b00ef3e320943e4.jpg",
    "title": "Stock Tracker",
    "companyName": "InvestSmart",
    "id": 14,
    "shortDescription": "Track stock prices and market trends.",
    "fullDescription": "Stock Tracker is your go-to app for monitoring stock prices and market trends in real time. Build and track portfolios, analyze performance with interactive charts, and receive personalized investment insights. Stay informed with breaking financial news and customizable alerts for price changes or market events. The app supports stocks, ETFs, and cryptocurrencies, with detailed data on historical performance and dividends. Create watchlists to monitor your favorite assets and simulate trades to test strategies. With a user-friendly interface and secure cloud sync, your investments are always at your fingertips. Share insights with friends or join investor communities for tips and discussions. Stock Tracker’s advanced analytics and forecasting tools empower beginners and seasoned investors alike. Offline access ensures you stay updated anywhere. Download Stock Tracker now to make informed financial decisions and grow your wealth with confidence and precision in the dynamic world of investing.",
    "size": 38,
    "reviews": 850,
    "ratingAvg": 4.0,
    "downloads": "220K",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/44/f1/a1/44f1a1b329b864e71f9ef881ab4ae2ae.jpg",
    "title": "Travel Planner",
    "companyName": "Wanderlust",
    "id": 15,
    "shortDescription": "Plan trips and explore destinations.",
    "fullDescription": "Travel Planner makes trip planning effortless with curated itineraries and personalized travel recommendations. Discover destinations, book flights, hotels, and activities, and manage all plans in one app. Explore detailed guides for cities, landmarks, and hidden gems, with insider tips from local experts. Create custom itineraries, share them with travel companions, and sync with calendars for seamless scheduling. The app offers offline maps, currency converters, and language guides for stress-free travel. Save favorite spots, track expenses, and receive real-time updates on flight delays or weather conditions. With a vibrant community, share experiences and get inspired by other travelers’ stories. Travel Planner’s intuitive design ensures easy navigation, while its secure backup keeps your plans safe. Whether you're planning a weekend getaway or a global adventure, this app makes every journey unforgettable. Download Travel Planner now to explore the world with confidence and excitement.",
    "size": 42,
    "reviews": 1100,
    "ratingAvg": 4.6,
    "downloads": "500K",
    "ratings": [
      { "name": "1 star", "count": 20 },
      { "name": "2 star", "count": 40 },
      { "name": "3 star", "count": 80 },
      { "name": "4 star", "count": 300 },
      { "name": "5 star", "count": 660 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/cc/46/3c/cc463c2e7e27496a872a378e146f427b.jpg",
    "title": "Password Manager",
    "companyName": "SecureVault",
    "id": 16,
    "shortDescription": "Securely store and manage passwords.",
    "fullDescription": "Password Manager keeps your digital life secure with state-of-the-art encryption. Store unlimited passwords, generate strong, unique ones, and access them across devices with seamless sync. Autofill logins for websites and apps to save time, and use biometric authentication for quick, secure access. Organize credentials by categories, add secure notes, and share passwords safely with trusted contacts. The app’s zero-knowledge architecture ensures only you can access your data. With offline support and cloud backups, your passwords are always available and protected. Receive alerts for weak or reused passwords and improve your security with built-in audits. Password Manager’s clean interface makes it easy for anyone to use, from tech novices to experts. Protect credit card details, IDs, and more with the same robust security. Download Password Manager now to safeguard your online accounts and enjoy peace of mind with effortless, secure password management.",
    "size": 15,
    "reviews": 300,
    "ratingAvg": 4.4,
    "downloads": "80K",
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 100 },
      { "name": "5 star", "count": 130 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/d1/fa/09/d1fa094ad4d8c99d3856993dd78423a1.jpg",
    "title": "Podcast Listener",
    "companyName": "AudioHub",
    "id": 17,
    "shortDescription": "Listen to podcasts from various genres.",
    "fullDescription": "Podcast Listener brings the world of podcasts to your fingertips with seamless streaming and offline playback. Explore thousands of shows across genres like true crime, education, and comedy, with curated recommendations tailored to your tastes. Subscribe to favorites, download episodes, and adjust playback speeds for a personalized experience. The app’s intuitive interface makes browsing easy, with features like chapter markers, sleep timers, and smart playlists. Sync your subscriptions across devices and never miss an episode. Share podcasts with friends or join communities to discuss trending shows. Podcast Listener supports high-quality audio and low-data streaming for uninterrupted listening. With regular updates, discover new content and features to enhance your experience. Whether you're commuting, exercising, or relaxing, this app delivers endless entertainment and knowledge. Download Podcast Listener now to dive into captivating stories and insights from creators worldwide, anytime, anywhere.",
    "size": 33,
    "reviews": 650,
    "ratingAvg": 4.2,
    "downloads": "180K",
    "ratings": [
      { "name": "1 star", "count": 25 },
      { "name": "2 star", "count": 50 },
      { "name": "3 star", "count": 100 },
      { "name": "4 star", "count": 200 },
      { "name": "5 star", "count": 275 }
    ]
  },
  {
    "image": "https://i.pinimg.com/736x/2d/a5/b1/2da5b154e5e7792ec1c3749f266a5d8b.jpg",
    "title": "Note Taker",
    "companyName": "QuickNotes",
    "id": 18,
    "shortDescription": "Take and organize notes efficiently.",
    "fullDescription": "Note Taker is your ultimate tool for capturing and organizing ideas effortlessly. Create notes with rich text, images, or voice recordings, and organize them by categories or tags for quick access. Sync notes across devices with secure cloud backup, ensuring your ideas are always available. Collaborate with teams, share notes, and edit in real time for seamless teamwork. The app’s powerful search and smart filters make finding notes a breeze, while handwriting recognition and OCR support digitize your thoughts. Set reminders, pin important notes, and customize your workspace with themes. With offline access and end-to-end encryption, your data stays secure and accessible anywhere. Note Taker’s clean interface is perfect for students, professionals, or creatives managing tasks, lectures, or brainstorming sessions. Export notes as PDFs or share them directly. Download Note Taker now to streamline your note-taking and boost productivity with a versatile, user-friendly solution.",
    "size": 19,
    "reviews": 450,
    "ratingAvg": 4.5,
    "downloads": "120K",
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 50 },
      { "name": "4 star", "count": 150 },
      { "name": "5 star", "count": 220 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/fe/d3/3f/fed33fb78192f2477fe516df4c3d0466.jpg",
    "title": "AR Explorer",
    "companyName": "VirtuaWorld",
    "id": 19,
    "shortDescription": "Explore augmented reality experiences.",
    "fullDescription": "AR Explorer unlocks a new dimension of entertainment with immersive augmented reality experiences. Interact with 3D objects, play AR games, and explore virtual environments overlaid on the real world. From educational simulations to interactive adventures, the app offers endless possibilities. Use your camera to place virtual objects, customize them, and share creations with friends. The intuitive interface and precise AR tracking make it easy for all ages to enjoy. Discover AR content like virtual tours, art installations, or gaming challenges, with regular updates adding new experiences. Collaborate with others in multiplayer AR modes or join global communities to showcase your creations. With offline support for select features and low battery usage, AR Explorer is perfect for on-the-go fun. Whether you're a tech enthusiast or a curious explorer, this app transforms your surroundings. Download AR Explorer now to dive into a world of interactive, augmented reality adventures.",
    "size": 60,
    "reviews": 1400,
    "ratingAvg": 4.1,
    "downloads": "400K",
    "ratings": [
      { "name": "1 star", "count": 70 },
      { "name": "2 star", "count": 140 },
      { "name": "3 star", "count": 210 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 580 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/fd/d0/0d/fdd00d4f341e7012551c6c97c7f748c3.jpg",
    "title": "Habit Builder",
    "companyName": "DailyRoutine",
    "id": 20,
    "shortDescription": "Build habits with daily reminders.",
    "fullDescription": "Habit Builder empowers you to create lasting positive habits with daily reminders and progress tracking. Set goals for fitness, productivity, or mindfulness, and receive motivational nudges to stay on track. Monitor streaks, analyze progress with detailed charts, and unlock achievements to stay motivated. The app’s intuitive interface lets you customize habit plans, set flexible schedules, and integrate with calendars for seamless planning. Share your journey with friends or join communities for accountability and inspiration. With offline support and secure backups, your progress is always safe. Habit Builder’s science-backed approach uses habit-stacking and micro-goals to ensure success. Whether you're building routines for exercise, reading, or meditation, this app makes habit formation rewarding and sustainable. Its clean design and personalized insights cater to all users, from beginners to habit experts. Download Habit Builder now to transform your daily routines and achieve your long-term goals with confidence.",
    "size": 24,
    "reviews": 550,
    "ratingAvg": 4.7,
    "downloads": "160K",
    "ratings": [
      { "name": "1 star", "count": 10 },
      { "name": "2 star", "count": 20 },
      { "name": "3 star", "count": 40 },
      { "name": "4 star", "count": 150 },
      { "name": "5 star", "count": 330 }
    ]
  }
]
