[
  {
    "image": "https://cdn.pixabay.com/photo/2016/10/22/00/15/spotify-1759471_1280.jpg",
    "title": "Spotify",
    "companyName": "Spotify AB",
    "id": 1,
    "shortDescription": "Stream millions of songs and podcasts.",
    "fullDescription": "Spotify revolutionizes the way you experience music and podcasts with its vast library of over 70 million tracks and 2.2 million podcast titles. The platform offers personalized music recommendations through its sophisticated algorithm that learns your taste over time. Create unlimited playlists for every mood and occasion, from workout sessions to relaxing evenings. Discover new artists through curated playlists like Discover Weekly and Release Radar that update automatically. Premium subscribers enjoy ad-free listening, unlimited skips, and high-quality audio streaming up to 320 kbps. Download your favorite content for offline listening during travel or limited connectivity. The app seamlessly syncs across all your devices including smartphones, tablets, computers, and smart speakers. Share music with friends through social features and collaborative playlists. Access exclusive content including Spotify Singles and original podcasts. The platform supports multiple languages and is available in over 180 markets worldwide. Experience immersive audio with Spotify HiFi for lossless quality streaming. Parental controls and explicit content filters ensure family-friendly listening. The app continuously evolves with new features like Spotify Connect for multi-device control and Canvas for artist storytelling. Join the global community of music lovers and creators shaping the future of audio entertainment.",
    "size": 85,
    "reviews": 3500000,
    "ratingAvg": 4.5,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 80000 },
      { "name": "3 star", "count": 200000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 2500000 }
    ]
  },
  {
    "image": "https://discover.daraz.com/images/Group_1083-1644460875.svg",
    "title": "Daraz",
    "companyName": "Daraz Group",
    "id": 2,
    "shortDescription": "Online shopping for everything you need.",
    "fullDescription": "Daraz stands as South Asia's premier e-commerce platform, serving millions of customers across Pakistan, Bangladesh, Sri Lanka, Nepal, and Myanmar with an extensive catalog exceeding 10 million products. The platform offers comprehensive shopping solutions across diverse categories including electronics, fashion, home appliances, beauty products, groceries, and automotive accessories. Experience secure shopping with multiple payment options including cash on delivery, credit/debit cards, mobile banking, and digital wallets. Benefit from Daraz Wallet for faster checkouts and exclusive rewards. The app features real-time order tracking with detailed delivery updates and estimated arrival times. Enjoy massive savings during flagship sales events like 11.11 and 12.12 with discounts up to 80% off. Seller Center empowers local businesses to reach wider audiences with tools for inventory management and sales analytics. Daraz Mall ensures authentic products from verified brands with warranty protection. The platform's recommendation engine suggests products based on browsing history and purchase patterns. Customer support operates 24/7 through multiple channels including live chat, email, and phone support. Daraz University provides educational resources for sellers to enhance their online business skills. Environmental initiatives include eco-friendly packaging and carbon-neutral delivery options. The app's intuitive interface supports multiple local languages and currencies. Regular feature updates introduce enhanced search filters, wishlist improvements, and social sharing capabilities. Join the Daraz affiliate program to earn commissions by promoting products. Experience seamless returns and refunds within specified warranty periods with dedicated pickup services.",
    "size": 60,
    "reviews": 1800000,
    "ratingAvg": 4.3,
    "downloads": "100M+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 120000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 500000 },
      { "name": "5 star", "count": 780000 }
    ]
  },
  {
    "image": "https://static.vecteezy.com/system/resources/previews/017/395/384/non_2x/youtube-music-icon-free-png.png",
    "title": "YouTube Music",
    "companyName": "Google LLC",
    "id": 3,
    "shortDescription": "Listen to music and watch music videos.",
    "fullDescription": "YouTube Music redefines music streaming by combining the world's largest catalog of official songs with the vast collection of music videos, live performances, remixes, and covers from YouTube. Access over 80 million official tracks alongside user-generated content that you won't find anywhere else. The smart recommendation system leverages Google's advanced AI to understand your musical taste across different moods and activities. Create personalized playlists that automatically update with new discoveries and old favorites. Premium subscribers enjoy completely ad-free listening, background play, and downloads for offline enjoyment. The app seamlessly integrates with your existing YouTube history and preferences for a unified entertainment experience. Explore music by mood with curated playlists for working out, relaxing, focusing, or partying. Discover new artists through dedicated channels and behind-the-scenes content unavailable on other platforms. Lyrics feature displays synchronized lyrics in real-time so you can sing along to every word. Voice commands through Google Assistant allow hands-free control for playing specific songs, artists, or playlists. Cross-device synchronization ensures your music follows you from phone to computer to smart speakers effortlessly. The offline mixtape feature automatically downloads recommended music based on your listening habits when connected to WiFi. High-quality audio streaming options cater to audiophiles with enhanced bitrate selections. Parental controls enable safe listening experiences for younger family members. Regular updates introduce features like smart downloads, improved search filters, and enhanced library organization. The platform supports music discovery through community-created playlists and trending charts. Experience music in 360-degree reality videos for immersive auditory experiences. Collaborative playlists allow friends and family to contribute to shared music collections.",
    "size": 75,
    "reviews": 2000000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 120000 },
      { "name": "2 star", "count": 160000 },
      { "name": "3 star", "count": 300000 },
      { "name": "4 star", "count": 700000 },
      { "name": "5 star", "count": 840000 }
    ]
  },
  {
    "image": "https://is1-ssl.mzstatic.com/image/thumb/Purple115/v4/c5/48/d3/c548d3a4-6290-52a1-e55a-daa4915153c2/AppIcon-0-0-1x_U007emarketing-0-0-0-7-0-0-sRGB-0-0-0-GLES2_U002c0-512MB-85-220-0-0.png/1200x630wa.png",
    "title": "PLAYit",
    "companyName": "Yuvadvance Internet Pvt. Ltd.",
    "id": 4,
    "shortDescription": "HD video player supporting all formats.",
    "fullDescription": "PLAYit supports all video formats including MP4, MKV, AVI, and more. Stream online videos and use floating play features seamlessly.",
    "size": 45,
    "reviews": 1200000,
    "ratingAvg": 4.6,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 50000 },
      { "name": "2 star", "count": 70000 },
      { "name": "3 star", "count": 150000 },
      { "name": "4 star", "count": 300000 },
      { "name": "5 star", "count": 630000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcSEOF5xMQwmt8ccJV582J1_bnybnDz4B1HD_Q&s",
    "title": "PUBG Mobile",
    "companyName": "Tencent Games",
    "id": 5,
    "shortDescription": "Battle Royale gaming at its finest.",
    "fullDescription": "PUBG Mobile represents the gold standard in mobile battle royale gaming, delivering a console-quality experience that has captivated over a billion players worldwide. This groundbreaking title drops 100 players onto massive, meticulously designed maps including Erangel, Miramar, Sanhok, and Vikendi, each with unique terrain, weather conditions, and tactical opportunities. The game's sophisticated graphics engine renders stunning visual details from realistic weapon models to dynamic environmental effects like changing weather and day-night cycles. Multiple gameplay modes cater to different preferences: Classic mode for traditional battle royale, Arcade for quick matches, EvoGround for creative gameplay variations, and Arena for competitive team deathmatches. Comprehensive control customization allows players to tailor button layout, sensitivity, and gyroscope settings for optimal combat performance. Voice chat system with noise cancellation enables clear team communication and strategic coordination during intense firefights. Regular seasonal updates introduce new weapons like the MG3 and Lynx AMR, vehicles including the Coupe RB, and game mechanics such as the recall system for revived teammates. The competitive ranking system spans from Bronze to Conqueror tiers with detailed statistics tracking and global leaderboards. Extensive character customization offers thousands of outfit combinations, weapon skins, vehicle designs, and emotes through the in-game shop and Royale Pass. Social features include friend lists, clans with custom emblems, and in-game messaging for community building. The game's anti-cheat system employs machine learning algorithms to detect and prevent unfair advantages. Performance optimization ensures smooth gameplay across a wide range of devices with graphics settings adjustable from Smooth to HDR quality. Training mode provides dedicated spaces for weapon practice, driving skills, and combat tactics development. Esports integration supports competitive gaming through official tournaments with substantial prize pools. The replay system allows detailed analysis of matches from multiple camera angles for strategy improvement. Cross-platform play enables matching with players on different devices while maintaining balanced gameplay. Accessibility features include colorblind modes, customizable interfaces, and simplified controls for diverse player needs. Regular collaboration events with popular franchises bring exclusive content and limited-time game modes. The game's massive download size reflects its rich content library and high-quality assets that continue to expand with each update.",
    "size": 1800,
    "reviews": 7000000,
    "ratingAvg": 4.3,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 1900000 },
      { "name": "5 star", "count": 2800000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/736x/48/21/c2/4821c2f23537fcdd1a358766e1cacf9b.jpg",
    "title": "Photo Editor",
    "companyName": "EditPro",
    "id": 6,
    "shortDescription": "Edit photos with advanced tools.",
    "fullDescription": "Photo Editor Pro emerges as a comprehensive digital darkroom that empowers both amateur photographers and professional creatives with an extensive suite of editing tools and artistic features. This powerful application supports high-resolution image editing up to 48 megapixels with non-destructive editing capabilities that preserve original image quality. The adjustment panel offers precise control over exposure, contrast, highlights, shadows, whites, blacks, and clarity with real-time previews. Color grading tools include HSL sliders for individual hue, saturation, and luminance adjustments across eight color ranges. Professional-grade curves editor provides pinpoint control over RGB channels and luminosity for advanced tonal adjustments. Over 200 meticulously crafted filters are categorized by style including vintage, cinematic, black & white, and modern aesthetics with adjustable intensity. Healing brush and clone stamp tools seamlessly remove imperfections, objects, or people from photos with content-aware filling technology. Layer support enables complex compositions with blend modes, opacity control, and masking capabilities rivaling desktop software. Text tool features hundreds of fonts with complete styling options including kerning, leading, and color gradients. Transform tools offer perspective correction, lens distortion fixes, and adaptive wide-angle adjustments. Selection tools include magic wand, quick select, and color range selection with feathering and refinement options. The app's AI-powered features include automatic background removal, sky replacement, and portrait enhancement with skin smoothing and eye brightening. Batch processing allows simultaneous editing of multiple photos with saved preset applications. RAW file support enables professional photographers to work with uncompressed image data from DSLR and mirrorless cameras. History panel tracks all editing steps with unlimited undo/redo functionality for complete creative freedom. Export options include multiple format choices (JPEG, PNG, WebP) with customizable compression levels and dimension presets. Cloud synchronization automatically backs up your projects and allows seamless editing across multiple devices. Tutorial library and in-app guidance help users master advanced editing techniques and creative effects. Social sharing integration supports direct posting to major platforms with optimized image sizes for each network. The app's interface is fully customizable with workspace layouts tailored for different editing workflows. Regular content updates introduce new filters, textures, frames, and editing tools based on user feedback and industry trends.",
    "size": 50,
    "reviews": 2000,
    "ratingAvg": 4.3,
    "downloads": "800K",
    "ratings": [
      { "name": "1 star", "count": 60 },
      { "name": "2 star", "count": 120 },
      { "name": "3 star", "count": 240 },
      { "name": "4 star", "count": 600 },
      { "name": "5 star", "count": 980 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/18/05/a3/1805a3366e8062d6fd77806201a8ded7.jpg",
    "title": "Music Player",
    "companyName": "TuneIn",
    "id": 7,
    "shortDescription": "Stream your favorite music tracks.",
    "fullDescription": "Music Player Pro stands as the ultimate audio companion that transforms your mobile device into a sophisticated music library and streaming powerhouse. This feature-rich application supports an extensive range of audio formats including MP3, FLAC, WAV, AAC, OGG, and M4A with bit-perfect playback for audiophile-grade listening experiences. The intelligent library management system automatically organizes your music collection by artist, album, genre, and folder structure with smart playlist creation based on play frequency, ratings, and recently added tracks. Advanced equalizer presets cater to different music genres with 10-band custom equalizer for precise audio tuning and sound signature customization. Visualizer effects transform your music into mesmerizing animated patterns that sync perfectly with the audio waveform and frequency spectrum. Lyrics display system automatically fetches synchronized lyrics from multiple databases with manual timing adjustment capabilities for perfect synchronization. Sleep timer functionality allows you to fall asleep to your favorite music with automatic shutdown after specified duration or at the end of current track. Crossfade feature creates seamless transitions between songs with adjustable duration from 1 to 15 seconds for uninterrupted listening sessions. Smart volume normalization ensures consistent audio levels across different tracks and albums for comfortable listening. The app's material design interface offers dark and light themes with complete color customization and layout options. Chromecast and AirPlay support enables wireless streaming to compatible speakers and home audio systems throughout your living space. Podcast management includes subscription handling, playback speed adjustment, and automatic episode download for offline listening. Radio functionality provides access to thousands of internet radio stations categorized by genre, language, and location with recording capability. Tag editor allows comprehensive metadata management including album art editing, lyric embedding, and batch tag operations across multiple files. Backup and restore features safeguard your playlists, settings, and equalizer presets with cloud synchronization options. Car mode interface offers simplified controls with larger buttons and voice commands for safe driving experiences. The app's widget system provides multiple home screen widgets with customizable appearance and quick control options. Regular updates introduce new audio effects, interface improvements, and performance optimizations based on user feedback and technological advancements.",
    "size": 40,
    "reviews": 1100,
    "ratingAvg": 4.4,
    "downloads": "600K",
    "ratings": [
      { "name": "1 star", "count": 35 },
      { "name": "2 star", "count": 75 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 400 },
      { "name": "5 star", "count": 440 }
    ]
  },
  {
    "image": "https://images.unsplash.com/photo-1611605698323-b1e99cfd37ea?ixlib=rb-4.1.0&ixid=M3wxMjA3fDB8MHxzZWFyY2h8Mnx8dGlrdG9rJTIwbG9nb3xlbnwwfHwwfHx8MA%3D%3D&fm=jpg&q=60&w=3000",
    "title": "TikTok",
    "companyName": "ByteDance Ltd.",
    "id": 8,
    "shortDescription": "Create and share short entertaining videos.",
    "fullDescription": "TikTok has revolutionized social media and content creation by pioneering the short-form video format that has captivated over a billion users globally. This dynamic platform enables creators to produce engaging videos ranging from 15 seconds to 10 minutes with an extensive suite of creative tools and effects. The integrated video editor offers timeline-based editing with precision trimming, multiple clip sequencing, and transition effects between scenes. Vast effects library includes augmented reality filters, green screen capabilities, time manipulation effects, and beauty enhancements that transform ordinary footage into captivating content. Music library features millions of licensed songs and sound bites that can be seamlessly synchronized to video content with beat matching technology. Duet and Stitch features allow collaborative content creation by combining your video with other users' content in split-screen or response formats. LIVE streaming capability enables real-time interaction with followers through comments, gifts, and Q&A sessions with multi-guest participation. Discovery algorithm personalizes the For You Page by analyzing watch time, engagement patterns, and content preferences to surface relevant videos. Hashtag challenges and viral trends create community-wide participation opportunities with featured placement on the platform. Creator Marketplace facilitates brand partnerships and sponsored content opportunities for monetizing creative efforts. Analytics dashboard provides detailed insights into viewer demographics, engagement metrics, and growth trends for content strategy optimization. Privacy controls offer granular settings for comment moderation, duet permissions, and download restrictions to ensure creator comfort and safety. Educational content spans countless topics from cooking tutorials to academic lessons, making knowledge sharing accessible and entertaining. Shopping features integrate e-commerce with video content through product links, live shopping events, and creator storefronts. Content moderation system employs both AI technology and human review to maintain community guidelines and ensure positive user experience. Accessibility features include closed captions, text-to-speech, and screen reader compatibility for inclusive content consumption. Global community connects users across cultural and geographical boundaries through shared interests and creative expression. Regular feature updates introduce new editing tools, effects, and interactive elements that keep the platform fresh and engaging for both creators and viewers.",
    "size": 95,
    "reviews": 8000000,
    "ratingAvg": 4.4,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 600000 },
      { "name": "2 star", "count": 700000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2100000 },
      { "name": "5 star", "count": 3400000 }
    ]
  },
  {
    "image": "https://upload.wikimedia.org/wikipedia/commons/9/9a/Visual_Studio_Code_1.35_icon.svg",
    "title": "Visual Studio Code",
    "companyName": "Microsoft Corporation",
    "id": 9,
    "shortDescription": "Code editing redefined — lightweight and fast.",
    "fullDescription": "Visual Studio Code has established itself as the definitive code editor for modern software development, blending lightweight performance with extensive customization and powerful features. This open-source editor supports virtually every programming language through its extensible architecture and intelligent IntelliSense code completion system. The integrated terminal provides full command-line access with support for PowerShell, Command Prompt, WSL, and custom shell configurations directly within the editor workspace. Git integration offers comprehensive version control capabilities including side-by-side diff viewing, branch management, and conflict resolution tools. Debugging tools feature breakpoint setting, call stack inspection, variable watching, and interactive debugging console for multiple runtime environments. Extensions marketplace hosts thousands of community-developed add-ons that enhance functionality for specific languages, frameworks, and development workflows. Multi-cursor editing allows simultaneous code modifications across multiple locations with smart selection and bulk editing capabilities. Zen mode creates a distraction-free coding environment by hiding all interface elements except the editor itself for focused programming sessions. Live Share enables real-time collaborative editing and debugging with shared terminals and audio call integration for remote pair programming. Integrated package managers support npm, NuGet, and other dependency management systems with automatic package.json and project file detection. Task runner integration automates build processes, test execution, and deployment workflows with customizable task configurations. Peek and Go to Definition features provide instant navigation through codebases with reference highlighting and quick access to implementation details. Snippet library accelerates coding with customizable code templates for common patterns and language-specific constructs. Settings sync automatically propagates your configurations, extensions, and keyboard shortcuts across all your development machines. Integrated browser preview allows web developers to see their changes in real-time without switching between applications. Language server protocol support ensures consistent coding assistance across different programming languages with advanced refactoring tools. File explorer with multi-root workspace support manages complex project structures with filtering, searching, and file organization features. Command palette provides keyboard-driven access to all editor functions with fuzzy search capabilities for rapid command discovery. Custom themes and icon packs allow complete personalization of the editor's appearance to match your preferences and reduce eye strain during extended coding sessions.",
    "size": 150,
    "reviews": 950000,
    "ratingAvg": 4.8,
    "downloads": "100M+",
    "ratings": [
      { "name": "1 star", "count": 15000 },
      { "name": "2 star", "count": 20000 },
      { "name": "3 star", "count": 40000 },
      { "name": "4 star", "count": 150000 },
      { "name": "5 star", "count": 725000 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2017/08/Chrome-Logo.png",
    "title": "Google Chrome",
    "companyName": "Google LLC",
    "id": 10,
    "shortDescription": "Fast, secure, and smart web browser.",
    "fullDescription": "Google Chrome represents the pinnacle of modern web browsing technology, combining blazing-fast performance with robust security features and intelligent assistance capabilities. This revolutionary browser is built upon the open-source Chromium project and features the powerful V8 JavaScript engine that compiles and executes code at unprecedented speeds. The multi-process architecture isolates each tab and extension into separate processes, ensuring that a single problematic webpage won't crash your entire browsing session. Smart omnibox serves as both address bar and search engine, providing autocomplete suggestions based on your browsing history, bookmarks, and popular searches from across the web. Tab management system includes tab grouping with color coding, pinning for frequently visited sites, and hibernation to reduce memory usage for inactive tabs. Password manager securely stores and auto-fills your login credentials across devices with optional biometric authentication for added security. Google Safe Browsing technology proactively warns you about dangerous websites, phishing attempts, and malicious downloads before they can cause harm. Translation feature automatically detects foreign language content and offers instant translation into your preferred language with a single click. Incognito mode provides private browsing that doesn't save your history, cookies, or form data while still maintaining full browser functionality. Extensions ecosystem offers thousands of developer-created add-ons that enhance functionality for productivity, entertainment, and specialized web tasks. Developer tools include comprehensive inspection capabilities, performance profiling, network analysis, and mobile device simulation for web development and debugging. Reading mode strips away distracting elements from articles and blog posts for comfortable reading with customizable text size and color schemes. Voice search integration allows hands-free browsing through Google Assistant with natural language processing for complex queries. Cross-device synchronization seamlessly transfers your bookmarks, history, passwords, and open tabs between your phone, tablet, and computer. Data saver mode compresses webpages and images to reduce data usage by up to 60% while maintaining content quality. Progressive Web App support enables websites to function like native applications with offline capabilities and home screen installation. Regular security updates are automatically delivered to protect against the latest web vulnerabilities and emerging threats. Custom search engines can be added for specialized queries across academic databases, programming documentation, and internal company resources. The browser's minimalist interface maximizes screen real estate for content while providing intuitive access to advanced features through carefully designed menus and gestures.",
    "size": 120,
    "reviews": 9000000,
    "ratingAvg": 4.6,
    "downloads": "5B+",
    "ratings": [
      { "name": "1 star", "count": 400000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2000000 },
      { "name": "5 star", "count": 4800000 }
    ]
  },
  {
    "image": "https://encrypted-tbn0.gstatic.com/images?q=tbn:ANd9GcREj1z2X_dnVNL8zWmZz1dyVER92lqd4fkD0g&s",
    "title": "Microsoft Office",
    "companyName": "Microsoft Corporation",
    "id": 11,
    "shortDescription": "Word, Excel, PowerPoint and more — all in one app.",
    "fullDescription": "Microsoft Office Mobile represents the culmination of decades of productivity software development, delivering the full power of Office applications in a unified mobile experience. This comprehensive suite integrates Word, Excel, PowerPoint, and PDF functionality into a single application with seamless document transition and shared services. Word mobile offers complete document creation and editing capabilities with support for advanced formatting, styles, comments, and track changes that maintain full compatibility with desktop versions. Excel mobile provides robust spreadsheet functionality including formulas, charts, pivot tables, and data analysis tools with touch-optimized interface for on-the-go calculations. PowerPoint mobile enables professional presentation creation with slide templates, transitions, animation effects, and presenter view for mobile rehearsals and remote presentations. PDF tools include annotation capabilities, form filling, digital signing, and conversion between PDF and Office formats with preserved formatting integrity. Real-time co-authoring allows multiple users to collaborate simultaneously on documents with presence indicators, change tracking, and integrated comment threads. The application leverages artificial intelligence through Microsoft Editor for advanced grammar checking, style suggestions, and clarity improvements across all document types. Template gallery offers hundreds of professionally designed templates for resumes, reports, budgets, presentations, and business documents that can be customized to specific needs. Cloud integration provides automatic saving to OneDrive, SharePoint, and Dropbox with version history and recovery options for accidentally deleted content. Mobile-optimized interface features contextual ribbons, touch-friendly controls, and gesture-based navigation that adapts to different screen sizes and orientations. Scanning feature uses your device camera to capture documents, whiteboards, and receipts with perspective correction, edge detection, and text recognition capabilities. Dictation functionality converts speech to text with punctuation commands and formatting instructions for hands-free document creation. Dark mode support reduces eye strain during extended editing sessions with automatic switching based on system preferences or scheduled timing. Accessibility features include screen reader compatibility, high contrast modes, and keyboard shortcuts for users with different abilities and preferences. Offline functionality ensures you can view and edit documents without internet connection with automatic synchronization when connectivity is restored. Security features include password protection, rights management, and information protection policies that follow organizational compliance requirements. The application's unified search capability indexes content across all your documents and cloud storage locations with filtering by file type, modification date, and author. Regular updates introduce new features, performance improvements, and compatibility enhancements that keep the mobile experience aligned with the evolving desktop Office ecosystem.",
    "size": 200,
    "reviews": 4000000,
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 100000 },
      { "name": "2 star", "count": 150000 },
      { "name": "3 star", "count": 400000 },
      { "name": "4 star", "count": 1100000 },
      { "name": "5 star", "count": 2250000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/09/8a/9a/098a9a920abd405c7c1ad37ad1919540.jpg",
    "title": "Video Editor",
    "companyName": "ClipMaster",
    "id": 12,
    "shortDescription": "Edit videos with professional tools.",
    "fullDescription": "Video Editor Pro revolutionizes mobile video production by bringing professional-grade editing capabilities to your smartphone or tablet, empowering creators to produce studio-quality content anywhere, anytime. This comprehensive editing suite supports multi-track timeline editing with unlimited video, audio, and effect layers that can be independently manipulated and animated. The precision timeline features frame-accurate editing with magnetic snapping, ripple editing, and slip-and-slide tools for seamless clip adjustments and transitions. Effects library includes over 500 professionally designed transitions, filters, and motion graphics that can be customized with timing, intensity, and blending mode adjustments. Color grading tools offer complete control over color correction with curves, wheels, and HSL adjustments that match the capabilities of desktop editing software. Audio editing capabilities include multi-track mixing, noise reduction, voice enhancement, and audio ducking for perfect balance between dialogue, music, and sound effects. Keyframe animation enables sophisticated motion graphics with position, scale, rotation, and opacity animations that can be precisely timed and eased for natural movement. Text and title tools feature hundreds of animated text presets with complete typography control, outline effects, shadows, and background options for professional captions. Speed control allows variable speed adjustments from 0.1x slow motion to 8x fast motion with frame blending and optical flow for smooth slow-motion effects. Green screen functionality enables advanced compositing with chroma key removal, spill suppression, and edge refinement for professional visual effects. Stabilization tools analyze shaky footage and apply smooth motion stabilization with adjustable intensity and cropping options. Masking and blending features include shape masks, gradient masks, and trackable masks that follow moving objects throughout your clips. 4K export capabilities maintain the highest video quality with support for multiple codecs including H.264, H.265, and ProRes for different quality and file size requirements. Storyboard mode provides simplified editing workflow for quick projects with drag-and-drop scene arrangement and automatic transition application. Template system offers complete project templates for social media formats, music videos, vlogs, and business presentations that can be customized with your media. Audio library includes royalty-free music tracks, sound effects, and ambient backgrounds categorized by mood, genre, and duration. Voice recording feature allows direct narration recording with real-time monitoring and noise cancellation for professional voiceovers. Social media optimization includes aspect ratio presets for Instagram, TikTok, YouTube, and other platforms with safe zone guides and export optimization. Collaboration features enable project sharing with other editors for team projects with change tracking and version management. The application's performance optimization ensures smooth editing even with multiple 4K clips and complex effects through proxy editing and background rendering. Regular content updates introduce new effects, transitions, and features based on user feedback and emerging video trends in the content creation community.",
    "size": 55,
    "reviews": 1300,
    "ratingAvg": 4.3,
    "downloads": "450K",
    "ratings": [
      { "name": "1 star", "count": 40 },
      { "name": "2 star", "count": 80 },
      { "name": "3 star", "count": 160 },
      { "name": "4 star", "count": 450 },
      { "name": "5 star", "count": 570 }
    ]
  },
  {
    "image": "https://www.freepnglogos.com/uploads/telegram-logo-png-0.png",
    "title": "Telegram",
    "companyName": "Telegram FZ-LLC",
    "id": 13,
    "shortDescription": "Fast and secure messaging.",
    "fullDescription": "Telegram delivers messages faster than any other application. Cloud-based and secure with secret chats.",
    "size": 88,
    "reviews": 4500000,
    "ratingAvg": 4.7,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 135000 },
      { "name": "2 star", "count": 180000 },
      { "name": "3 star", "count": 360000 },
      { "name": "4 star", "count": 1080000 },
      { "name": "5 star", "count": 2745000 }
    ]
  },
  {
    "image": "https://i.pinimg.com/1200x/6f/48/c4/6f48c461187dba824b00ef3e320943e4.jpg",
    "title": "Stock Tracker",
    "companyName": "InvestSmart",
    "id": 14,
    "shortDescription": "Track stock prices and market trends.",
    "fullDescription": "Stock Tracker is your go-to app for monitoring stock prices and market trends in real time. Build and track portfolios, analyze performance with interactive charts, and receive personalized investment insights. Stay informed with breaking financial news and customizable alerts for price changes or market events. The app supports stocks, ETFs, and cryptocurrencies, with detailed data on historical performance and dividends. Create watchlists to monitor your favorite assets and simulate trades to test strategies. With a user-friendly interface and secure cloud sync, your investments are always at your fingertips. Share insights with friends or join investor communities for tips and discussions. Stock Tracker’s advanced analytics and forecasting tools empower beginners and seasoned investors alike. Offline access ensures you stay updated anywhere. Download Stock Tracker now to make informed financial decisions and grow your wealth with confidence and precision in the dynamic world of investing.",
    "size": 38,
    "reviews": 850,
    "ratingAvg": 4.0,
    "downloads": "220K",
    "ratings": [
      { "name": "1 star", "count": 50 },
      { "name": "2 star", "count": 100 },
      { "name": "3 star", "count": 150 },
      { "name": "4 star", "count": 250 },
      { "name": "5 star", "count": 300 }
    ]
  },
  {
    "image": "https://www.freepnglogos.com/uploads/discord-logo-png/discord-logo-logodownload-download-logotipos-1.png",
    "title": "Discord",
    "companyName": "Discord Inc.",
    "id": 15,
    "shortDescription": "Chat for gamers and communities.",
    "fullDescription": "Discord is the easiest way to talk over voice, video, and text. Create communities and hang out with friends.",
    "size": 130,
    "reviews": 3800000,
    "ratingAvg": 4.8,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 76000 },
      { "name": "2 star", "count": 114000 },
      { "name": "3 star", "count": 228000 },
      { "name": "4 star", "count": 912000 },
      { "name": "5 star", "count": 2470000 }
    ]
  },
  {
    "image": "https://www.freepnglogos.com/uploads/snapchat-logo-png-0.png",
    "title": "Snapchat",
    "companyName": "Snap Inc",
    "id": 16,
    "shortDescription": "Fast and fun way to communicate.",
    "fullDescription": "Snapchat is a fast and fun way to share moments with friends. Use lenses and filters to express yourself.",
    "size": 145,
    "reviews": 7800000,
    "ratingAvg": 4.2,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 780000 },
      { "name": "2 star", "count": 624000 },
      { "name": "3 star", "count": 1170000 },
      { "name": "4 star", "count": 2184000 },
      { "name": "5 star", "count": 3042000 }
    ]
  },
  {
    "image": "https://1000logos.net/wp-content/uploads/2021/06/Zoom-Logo-2014.png",
    "title": "Zoom Cloud Meetings",
    "companyName": "Zoom Video Communications",
    "id": 17,
    "shortDescription": "Video conferencing and meetings.",
    "fullDescription": "Zoom offers video and audio conferencing with collaboration tools. Host webinars and online meetings easily.",
    "size": 120,
    "reviews": 4200000,
    "ratingAvg": 4.6,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 168000 },
      { "name": "2 star", "count": 210000 },
      { "name": "3 star", "count": 420000 },
      { "name": "4 star", "count": 1260000 },
      { "name": "5 star", "count": 2142000 }
    ]
  },
  {
    "image": "https://thumbs.dreamstime.com/b/amazon-logo-editorial-vector-illustration-market-136495269.jpg",
    "title": "Amazon Shopping",
    "companyName": "Amazon Mobile LLC",
    "id": 18,
    "shortDescription": "Shop anywhere,anycountry and anytime.",
    "fullDescription": "Browse millions of products, read reviews, and shop securely. Fast delivery and easy returns available.",
    "size": 140,
    "reviews": 9500000,
    "ratingAvg": 4.3,
    "downloads": "500M+",
    "ratings": [
      { "name": "1 star", "count": 665000 },
      { "name": "2 star", "count": 760000 },
      { "name": "3 star", "count": 1520000 },
      { "name": "4 star", "count": 2850000 },
      { "name": "5 star", "count": 3705000 }
    ]
  },
  {
    "image": "https://images.ctfassets.net/y2ske730sjqp/1aONibCke6niZhgPxuiilC/2c401b05a07288746ddf3bd3943fbc76/BrandAssets_Logos_01-Wordmark.jpg?w=940",
    "title": "Netflix",
    "companyName": "Netflix, Inc.",
    "id": 19,
    "shortDescription": "Watch TV shows and movies anytime.",
    "fullDescription": "Stream thousands of TV shows, movies, and Netflix originals. Download to watch offline on your mobile device.",
    "size": 115,
    "reviews": 8500000,
    "ratingAvg": 4.6,
    "downloads": "1B+",
    "ratings": [
      { "name": "1 star", "count": 340000 },
      { "name": "2 star", "count": 425000 },
      { "name": "3 star", "count": 850000 },
      { "name": "4 star", "count": 2125000 },
      { "name": "5 star", "count": 4760000 }
    ]
  },
  {
    "image": "https://www.freepnglogos.com/uploads/youtube-logo-png-images-0.png",
    "title": "YouTube",
    "companyName": "Google LLC",
    "id": 20,
    "shortDescription": "Watch, create, and share videos.",
    "fullDescription": "Discover, watch, and share your favorite videos and music. Join the YouTube community of creators and viewers.",
    "size": 135,
    "reviews": 10000000,
    "ratingAvg": 4.4,
    "downloads": "10B+",
    "ratings": [
      { "name": "1 star", "count": 500000 },
      { "name": "2 star", "count": 600000 },
      { "name": "3 star", "count": 1200000 },
      { "name": "4 star", "count": 2800000 },
      { "name": "5 star", "count": 4900000 }
    ]
  }
]
